       01 BOOK.
           05 BOOK-ID PIC 9(10).
           05 BOOKNAME PIC X(50).
           05 AUTHORNAME PIC X(50).
           05 STUDENTNAME PIC X(50).
           05 STUDENTADDR PIC X(300).
           05 ISSUE-DATE.
               10 MM PIC 9(2).
               10 DD PIC 9(2).
               10 YYYY PIC 9(4).
           05 BORROWDATE.
               10 BMM PIC 9(2).
               10 BDD PIC 9(2).
               10 BYYYY PIC 9(4).
           05 BAVAIL PIC X.
