       01 BBOOK.
           05 BORROW-REF-ID.
               10 BORROWER-ID PIC 9(10).
               10 BBOOK-ID PIC 9(10).
           05 BORROWDATE.
               10 BMM PIC 9(2).
               10 BDD PIC 9(2).
               10 BYYYY PIC 9(4).
           05 BQUANTITY PIC 9(4).
