       01 BBOOK-WS.
           05 BORROW-REF-ID-WS.
               10 BORROWER-ID-WS PIC 9(10).
               10 BBOOK-ID-WS PIC 9(10).
           05 BORROWDATE-WS.
               10 BMM-WS PIC 9(2).
               10 BDD-WS PIC 9(2).
               10 BYYYY-WS PIC 9(4).
           05 BQUANTITY-WS PIC 9(4).
