       IDENTIFICATION DIVISION.
       PROGRAM-ID. MainProgram.

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           CALL "WelcomeMessage".
           CALL "Menu".
           STOP RUN.
