       IDENTIFICATION DIVISION.
       PROGRAM-ID. PrintMessageCenter.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 LEN-WS PIC 9(9) VALUE ZERO.
       01 POS-WS PIC 9(9) VALUE ZERO.

       LINKAGE SECTION.
       01  STRING-MESSAGE-LS PIC X ANY LENGTH.

       PROCEDURE DIVISION USING STRING-MESSAGE-LS.
           COMPUTE LEN-WS=(78 - FUNCTION LENGTH(STRING-MESSAGE-LS))/2.
           PERFORM LEN-WS TIMES
               DISPLAY " " WITH NO ADVANCING
           END-PERFORM.
           DISPLAY STRING-MESSAGE-LS.
           EXIT PROGRAM.

           
